Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidSpecification Property
 The part specification is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartInvalidSpecification { get; }
Public Shared ReadOnly Property FabricationPartInvalidSpecification As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartInvalidSpecification {
	FailureDefinitionId^ get ();
}
static member FabricationPartInvalidSpecification : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace